Revit 2026 API

# ReshapeFromFacetsFailures Properties

---

The BuiltInFailuresReshapeFromFacetsFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReshapeFromFacetsFailed | Reshape from facets failed. [Description] |
|  | ReshapeFromFacetsFailedError | Reshape from facets failed. [Description] |

#### Reference

BuiltInFailuresReshapeFromFacetsFailures Class

Autodesk.Revit.DB Namespace